# St7GetNFAShift

Returns the frequency shift assigned to the natural frequency analysis. The closest modes found, both above and
below the shift value, will be calculated.

long St7GetNFAShift(long uID, double* Shift)

Input Parameters

uID

Strand7 model file ID.

Solver – Natural Frequency

Output Parameters

Shift

Frequency shift (Hz).